In [ ]:
import pytae as pt
import pandas as pd

In [ ]:
nums=['x','y','z']
non_nums=['a','b','c']
pt.create_qry('data','tbl',nums,non_nums)

'select a, b, c, sum(x) as x, sum(y) as y, sum(z) as z from data.tbl group by a, b, c;'

In [ ]:
nums={'x':['sum','x1'],'y':['sum','y1'],'z':['sum','z1']}
non_nums=['a','b','c']

pt.create_qry('data','tbl',nums,non_nums)

'select a, b, c, sum(x) as x1, sum(y) as y1, sum(z) as z1 from data.tbl group by a, b, c;'

In [ ]:
pt.create_qry('data','tbl',nums,non_nums,'where c=18')

'select a, b, c, sum(x) as x1, sum(y) as y1, sum(z) as z1 from data.tbl where c=18 group by a, b, c;'

In [ ]:

df=pd.DataFrame({'id':['a','b','c','d','e','','f','f'],
                  'balance':[10,20,0,21,15,10,20,25],
                  'country':['sg','cn','ca','np','in','in','np','in']})

df

  id  balance country
0  a       10      sg
1  b       20      cn
2  c        0      ca
3  d       21      np
4  e       15      in
5          10      in
6  f       20      np
7  f       25      in

In [ ]:
df[['id','balance']].agg_df()

  id  balance
0          10
1  a       10
2  b       20
3  c        0
4  d       21
5  e       15
6  f       45